package com.likemagic.masters_beside.repository

import kotlin.concurrent.thread

class ProfessionGetter {
        fun getAllProfession() = listOf(
            Profession("Автоподборщик", listOf("Автоподборщик","Автоподбор", "Подобрать авто", "Выбрать автомобиль", "Помочь выбрать автомобиль", "Помочь с выбором автомобиля")),
            Profession("Администратор", listOf("Администратор")),
            Profession("Архитектор", listOf("Архитектор", "Чертеж", "Проектиорвание")),
            Profession("Астролог", listOf("Астролог","Сиснастрия", "Прогноз", "Психологический портрет личности", "Выбор даты для важного события")),
            Profession("Автомеханик", listOf("Автомеханик", "Ремонт автомобиля", "Сделать автомобиль", "Автослесарь", "Ремонт двигателя", "Ремонт подвески", "Ремонт коробки", "Ремонт АКПП", "Диагностика авто", "Замена масла")),
            Profession("Адвокат", listOf("Услуги адвоката", "Адвокат")),
            Profession("Автомаляр", listOf("Автомаляр","Покрасить машину", "Подкрасить машину", "Полировка авто", "Полировка", "Подготовка в покраске", "Рихтовочные работы")),
            Profession("Автоэлектрик", listOf("Автоэлектрик", "Проводка", "Электрооборудование")),
            Profession("Автомойщик", listOf("Автомойщик","Мойка авто", "Помыть машину", "Помыть авто", "Пылесос", "Пропылесосить", "Убраться в машине")),
            Profession("Аниматор", listOf("Аниматор", "Праздник", "День рождения", "Поздравить", "Сделать сюрприз")),
            Profession("Аэрографист", listOf("Аэрографист", "Аэрография")),
            Profession("Бухгалтер", listOf("Бухгалтер", "Бухучет", "Дебет", "Бухгалтерская отчетность", "Налоговая отчетность", "1с: бухгалтерия", "Отчетность")),
            Profession("Барбер", listOf("Барбер", "Бритье","Мужские стрижки","Стрижка","Борода", "Побрить", "Подстричь", "Стрижка бороды")),
            Profession("Бульдозерист", listOf("Бульдозерист", "Земляные работы", "Выкопать", "Откопать", "Раскопать")),
            Profession("Бурильщик", listOf("Бурильщик", "Пробурить", "Скважина", "Буровые работы")),
            Profession("Водитель", listOf("Водитель", "Автомобильные перевозки", "Перевозки", "Грузоперевозки", "Автомобиль", "Личный автомобиль", "Вождение автомобиля", "Грузовой транспорт")),
            Profession("Видеооператор", listOf("Видеооператор", "Видео", "Снять видео")),
            Profession("Ветеринар", listOf("Ветеринар", "Вылечить собаку", "Вылечить кошку", "Вылечить животное")),
            Profession("Визажист", listOf("Визажист", "Сделать макияж", "Коррекция бровей", "Окрашивание бровей", "Окрашивание ресниц", "Брови", "Ресницы", "Макияж", "Ламинирование ресниц", "Архитектура бровей", "Наращивание ресниц", "Ламинирование бровей")),
            Profession("Воспитатель", listOf("Воспитатель", "Работа с детьми", "Дети", "Ребенок")),
            Profession("Гадалка", listOf("Гадалка", "Погадать")),
            Profession("Гравер", listOf("Гравер", "Выгравировать", "Сделать гравировку")),
            Profession("Грузчик", listOf("Грузчик", "Занести", "Поднять", "Тяжелый", "Переезд")),
            Profession("Дворник", listOf("Дворник", "Подмести", "Убрать снег")),
            Profession("Детский учитель", listOf("Детский учитель")),
            Profession("Дизайнер", listOf("Дизайнер","Дизайн")),
            Profession("Замерщик", listOf("Замерщик",)),
            Profession("Заточник", listOf("Заточник",)),
            Profession("Каменщик", listOf("Каменщик", "Положить кирпич","Положить блоки","Положить кладку",)),
            Profession("Копирайтер", listOf("Копирайтер", "Написание текстов", "Написать текст", "Написание статей", "Статья", "Рерайтинг", "Наполнить контент", "Редактировать текст", "Работа с текстом")),
            Profession("Кровельщик", listOf("Кровельщик", "Накрыть крышу", "Сделать крышу", "Кровельные работы")),
            Profession("Кинолог", listOf("Кинолог", "Научить собаку", "Воспитать собаку", "Команды собаке")),
            Profession("Компьютерный мастер", listOf("Компьютерный мастер", "Сделать компьютер", "Компьютер", "Отремонтировать компьютер", "Ремонт компьютеров", "Работа с компьютером")),
            Profession("Курьер", listOf("Курьер", "Доставить", "Привезти", "Передать")),
            Profession("Косметолог", listOf("Косметолог", )),
            Profession("Клинер", listOf("Клинер",)),
            Profession("Кондитер", listOf("Кондитер",)),
            Profession("Крановщик", listOf("Крановщик",)),
            Profession("Консультант", listOf("Консультант",)),
            Profession("Кулинар", listOf("Кулинар",)),
            Profession("Кузнец", listOf("Кузнец",)),
            Profession("Логопед", listOf("Логопед", "Недостатки речи", "Говорить правильно")),
            Profession("Маляр", listOf("Маляр", "Малярные работы")),
            Profession("Модельер", listOf("Модельер", "Дизайн одежды", "Моделирование", "Мода", "Одежда", "Моделирование одежды")),
            Profession("Мебельщик", listOf("Мебельщик","Сборка мебели", "Собрать мебель")),
            Profession("Массажист", listOf("Массажист", "Массаж", "Сделать массаж", "Массажировать", "Антицеллюлитный массаж", "Лечебный массаж", "Обертывания")),
            Profession("Мастер маникюра", listOf("Мастер маникюра", "Ногти", "Сделать ногти", "Накрасить ногти", "Педикюр", "Маникюр", "Наращивание ногтей", "Аппаратный маникюр", "Дизайн ногтей", "Комбинированный маникюр")),
            Profession("Механик", listOf("Механик",)),
            Profession("Мойщик посуды", listOf("Мойщик посуды",)),
            Profession("Мойщик окон", listOf("Мойщик окон",)),
            Profession("Мойщик ковров", listOf("Мойщик ковров",)),
            Profession("Монтажник потолков", listOf("Монтажник потолков",)),
            Profession("Монтажник окон", listOf("Монтажник окон",)),
            Profession("Муж на час", listOf("Муж на час",)),
            Profession("Нотариус", listOf("Нотариус","Услуги нотариуса")),
            Profession("Няня", listOf("Няня",)),
            Profession("Отделочник", listOf("Отделочник", "Отделка помещений", "Фасадные работы")),
            Profession("Озеленитель", listOf("Озеленитель")),
            Profession("Охранник", listOf("Охранник")),
            Profession("Оценщик", listOf("Оценщик")),
            Profession("Обувной мастер", listOf("Обувной мастер")),
            Profession("Организатор праздников", listOf("Организатор праздников")),
            Profession("Плотник", listOf("Плотник", "Плотницкие работы")),
            Profession("Программист", listOf("Программист", "Photoshop", "Фотошоп", "1с программист")),
            Profession("Психолог", listOf("Психолог", "Психологоичская помощь", "Помощь психолога")),
            Profession("Парикмахер", listOf("Парикмахер", "Стрижка", "Мужские стрижки", "Женские стрижки","Детские стрижки","Мелирование","Завивка", "Покрасить волосы", "Окрашивание волос", "Укладка волос", "Колорирование", "Прическа", "Сдеалть прическу")),
            Profession("Переводчик", listOf("Переводчик",)),
            Profession("Педагог", listOf("Педагог",)),
            Profession("Печник", listOf("Печник",)),
            Profession("Плиточник", listOf("Плиточник",)),
            Profession("Промышленный альпинист", listOf("Промышленный альпинист",)),
            Profession("Пчеловод", listOf("Пчеловод",)),
            Profession("Повар", listOf("Повар",)),
            Profession("Расклейщик", listOf("Расклейщик",)),
            Profession("Разнорабочий", listOf("Разнорабочий", "Покосить", "Помочь", "")),
            Profession("Репетитор", listOf("Репетитор", "Русский язык", "Физика", "Химия", "Английский язык", "Немецкий язык", "Франзуцский язык", "Биология", "Информатика", "История")),
            Profession("Реставратор ванн", listOf("Реставратор ванн",)),
            Profession("Риэлтор", listOf("Риэлтор",)),
            Profession("Ремесленник", listOf("Ремесленник",)),
            Profession("Садовник", listOf("Садовник",)),
            Profession("Строитель", listOf("Строитель", "Построить","Коттеджное строительство", "Залить стяжку","Залить фундамент", "Строительно-монтажные работы")),
            Profession("Сантехник", listOf("Сантехника", "Слесарные работы", "Монтаж сантехники", "Полипропилен", "Трубы", "Кран", "Смеситель","Канализация", "Водоснабжения", "Сантехнические работы", "Аварийно-восстановительные работы")),
            Profession("Сварщик", listOf("Сварщик", "Сварочные работы", "Сварить", "Заварить", "Подварить", "Сварка")),
            Profession("Столяр", listOf("Столяр", "Деревообработка", "Работа с деревом")),
            Profession("Стилист", listOf("Стилист", "Стиль")),
            Profession("Стоматолог", listOf("Стоматолог")),
            Profession("Страховой агент", listOf("Страховой агент",)),
            Profession("Тату-мастер", listOf("Тату мастер", "Тату", "Сделать татуировку", "Сделать тату", "Набить тату", "Нанесение тату")),
            Profession("Тамада", listOf("Тамада",)),
            Profession("Тракторист", listOf("Тракторист",)),
            Profession("Телефонный мастер", listOf("Телефонный мастер",)),
            Profession("Токарь", listOf("Токарь","Токарные работы", "Выточить", "Расточить")),
            Profession("Фотограф", listOf("Фотограф", "Фотосессия", "Сделать фото", "Пофотографировать", "Фотография", "Портретная фотосъемка", "Фотосъемка", "Студийная фотосъемка", "Ретушь", "Фотомонтаж", "Обработка фото", "Фото", "Фотошоп", "Съемка")),
            Profession("Фрилансер", listOf("Фрилансер",)),
            Profession("Художник", listOf("Художник", "Нарисовать", "Рисунок")),
            Profession("Часовщик", listOf("Часовщик", "Ремонт часов", "Часы")),
            Profession("Швея", listOf("Швея", "Сшить", "Шитье", "Пошив", "Пошив одежды")),
            Profession("Штукатур", listOf("Штукатур", "Штукатурные работы", "Оштукатурить стену",)),
            Profession("Электрик", listOf("Электрик", "Электротехнические работы", "Проводка", "Электрика", "Электрооборудования", "Электромонтажные работы", "Монтаж электрики", "Электрические сети", "Слаботочные системы", "Электросхемы", "Энергетика")),
            Profession("Экскурсовод", listOf("Экскурсовод", "Экскурсия", "Провести экскурсию",)),
            Profession("Экскаваторщик", listOf("Экскаваторщик",)),
            Profession("Ювелир", listOf("Ювелир", "Сделать кольцо", "Сделать цепочку", "Сделать браслет", "Спаять", "Ювелирные изделия", "Полировка")),
            Profession("Юрист", listOf("Услуги юриста", "Юрист")),
        )

    private val professionList = getAllProfession()
    fun getProfessionByName(search:String, callback: (List<Profession>) -> Unit){
        thread {
            val tempList = ArrayList<Profession>()
            for (select: Profession in professionList) {
                var counter = 0
                if (search.length <= select.name.length) {
                    for (i in search.indices) {
                        if (search[i] == select.name[i]) {
                            counter++
                        }
                        if (counter == search.length) {
                            tempList.add(select)
                            tempList.sortWith(compareBy { it.name })
                        } else {
                            tempList.remove(select)
                        }
                    }
                }
            }
            callback.invoke(tempList)
        }
    }

    fun getProfessionByKeyWords(search: String, callback:(List<Profession>) -> Unit){
        thread {
            val tempList = ArrayList<Profession>()
            for(select:Profession in professionList){
                for(chars:CharSequence in select.keyWords){
                    if(search in chars){
                        if(select !in tempList){
                            tempList.add(select)
                            tempList.sortWith(compareBy { it.name })
                        }
                    }
                }
            }
            if(search.isEmpty()){
                tempList.clear()
            }
            callback.invoke(tempList)
        }
    }
}